do
function run(msg, matches)
if is_momod(msg) then
return [[ 

🔘 دستورات ربات 🔘
⛔️ اداره اعضا ⛔️
اخراج {یوزرنیم/ریپلای}
🚷 اخراج فرد از گروه 🚷
بن {یوزرنیم/ریپلای}
❌ بن کردن فرد ❌️
حذف بن {یوزرنیم}
✅ خارج کردن فرد از بن ✅
ایدی {ریپلای/معمولی}
🆔 نمایش ایدی 🆔
☢ اداره گروه ☢
تنظیم قوانین {متن}
♒️ تنظیم متن به عنوان قوانین گروه ♒️
قوانین
♋️ نمایش قوانین گروه ♋️
تنظیم توضیحات  {متن}
⚜ تنظیم یک متن به عنوان توضیحات ⚜
توضیحات
⭕️ دریافت توضیحات ⭕️
تنظیم نام {نام}
🔶 تنظیم نام گروه 🔶
تنظیم عکس
🎴 تنظیم عکس گروه 🎴
ترفیع {ریپلای/یوزرنیم}
〽️ ترفیع مدیر جدید 〽️
تنزل {ریپلای/یوزرنیم}
❎ تنزل یک مدیر ❎
پاک کردن {مدیران/توضیحات/قوانین}
❌ پاک کردن هر یک از این ایتم ها ❌
قفل {نام/اعضا/اسپم/لینک/تگ/فحش/اینگلیسی/ورود/رسانه/اشتراک گذاری }
🔒 قفل هر یک از این ایتم ها 🔒
بازکردن  {نام/عکس/اعضا/اسپم/لینک/تگ/فحش/اینگلیسی/ورود/رسانه/اشتراک گذاری}
🔓 باز کردن قفل هر یک از این ها 🔓
لیست مدیران
👤 نمایش لیست مدیر ها 👤
دارنده {ریپلای/ایدی}
💂 تنظیم فرد به عنوان صاحب گروه 💂
حساسیت {عدد}
🚨 نتنظیم حساسیت به اسپم 🚨
⚙ تنظیمات ⚙ 
نمایش تنظیمات گروه
اینفو {یوزرنیم/ریپلای/معمولی}
▪️ نمایش مشخصات ▪️
 
🔧 ابزار ها 🔧
محاسبه {فرمول}
🔢 محاسبه یک فرمول ریاضی 🔢
به {نام} بگو {متن}
🗣 گفتن یک متن به یک نام 🗣
بگو {متن}
🤖 تکرار یک متن 🤖
زمان {شهر}
⏱ نشان دادن زمان در یک شهر ⏱
تبدیل {متن}
〰 تبدیل یک متن به عکس 〰
تصویر {آدرس}
📷 تصویر یک سایت 📷
تگ {متن}
📨 تگ کردن همه افراد گروه و ارسال یک متن (فقط مدیران) 📨

⚫️ فیلترینگ ⚫️
➕ فیلتر + {کلمه} ➕
فیلتر کردن یک کلمه
➖ فیلتر – {کلمه) ➖
حذف فیلتر یک کلمه
🔻 لیست فیلتر 🔻
لیست کلمات فیلتر شده
------------------------------

Joker Anti Spam 
Id Bot: @JokerAnti
Id Pm Bot: @jokerpmbot

------------------------------

]]
end
end
return {
patterns = {
"^(راهنما)$",
"^(help fa)$",
" ^[/#!](help fa)$",
},
run = run
}
end
